In [31]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [38]:
books = pd.read_csv("books_additional.csv")
books.head()

,Semester,Class,Class Number,Section Number,Title,Author(s),Gender,Number Students
0,Spring 2012,Reading & Composition: American Song,English R1A,1,Souls of Black Folk,['W. E. B. Du Bois'],male,16.0
1,Spring 2012,Reading & Composition: American Song,English R1A,1,The American Songbag,['Carl Sandburg'],male,16.0
2,Spring 2012,Reading & Composition: American Song,English R1A,1,American Ballads and Folk SOngs,['Alan Lomax'],male,16.0
3,Spring 2012,Reading & Composition: Apocalypse / Now,English R1A,2,On the Principle of Population,['Thomas Robert Malthus'],male,18.0
4,Spring 2012,Reading & Composition: Apocalypse / Now,English R1A,2,The Road,['Cormac McCarthy'],male,18.0

In [49]:
# Number of male authors per semester (ignoring weight of classes)
male = books.copy()
male['Male'] = [1 if g == 'male' else 0 for g in books['Gender']]

drop_cols = ['Class', 'Class Number', 'Section Number', 'Title', 'Author(s)', 'Gender', 'Number Students']
for col in drop_cols:
    del male[col]

male = male.groupby('Semester').sum()
male

             Male
Semester
Fall 2012     239
Fall 2013     240
Fall 2014     250
Fall 2015     196
Fall 2016     179
Fall 2017     201
Spring 2012   260
Spring 2013   148
Spring 2014   243
Spring 2015   223
Spring 2016   217
Spring 2017   204
Summer 2012    51
Summer 2013     7
Summer 2014    26
Summer 2015    10
Summer 2016    13
Summer 2017    25